# IFC_DMGetObjCategory

## Description
Returns the Category for the Indicated Object.

```pascal
FUNCTION IFC_DMGetObjCategory(
				strObjectName          : STRING;
				VAR outMappingCategory : INTEGER) : BOOLEAN;
```

```python

def vs.IFC_DMGetObjCategory(strObjectName):
    return (BOOLEAN, outMappingCategory)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strObjectName|STRING||
|outMappingCategory|INTEGER||

## Version
Availability: from Vectorworks 2021
## Category
* IFC